tap "1password/tap"
tap "candid82/brew"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jakehilborn/jakehilborn"
tap "pulumi/tap"
tap "sourcegraph/src-cli"
tap "yqrashawn/goku"

brew "aom"
brew "asciidoc"
brew "asciinema"
brew "aspell"
brew "awscli"
brew "bat"
brew "boost"
brew "btop"
brew "cmake"
brew "coreutils"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-modern-doom3-icon", "with-native-comp"]
brew "datasette"
brew "direnv"
brew "discount"
brew "docutils"
brew "entr"
brew "exa"
brew "fd"
brew "fdupes"
brew "ffmpeg"
brew "fx"
brew "gh"
brew "git"
brew "git-delta"
brew "glib"
brew "gmailctl"
brew "gnutls"
brew "go-jsonnet"
brew "harfbuzz"
brew "httperf"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "ispell"
brew "jpeg-xl"
brew "jq"
brew "jsonschema"
brew "leiningen"
brew "libavif"
brew "libheif"
brew "libpq"
brew "libraw"
brew "librsvg"
brew "libvterm"
brew "libxml2"
brew "lua"
brew "luarocks"
brew "mas"
brew "mtr"
brew "ncdu"
brew "netpbm"
brew "node"
brew "openjdk"
brew "pango"
brew "pgcli"
brew "postgresql@14"
brew "protobuf", link: false
brew "pulumi/tap/pulumi"
brew "python-tabulate"
brew "python@3.10"
brew "rbenv"
brew "ripgrep"
brew "ruby-build"
brew "rust"
brew "semgrep"
brew "shellcheck"
brew "shfmt"
brew "sourcegraph/src-cli/src-cli"
brew "telnet"
brew "tmux"
brew "tree"
brew "ugrep"
brew "watch"
brew "wget"
brew "yqrashawn/goku/goku"
brew "zbar"
brew "zsh"
brew "zstd"

cask "1password"
cask "1password-cli"
cask "bettertouchtool"
cask "dash"
cask "fantastical"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
cask "font-iosevka-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "hazeover"
cask "iterm2"
cask "karabiner-elements"
cask "notion"
cask "slack"
cask "soulver"
cask "yubico-yubikey-manager"
cask "zoom"

if ENV['PERSONAL_BREW']
  brew "youtube-dl"

  cask "aerial"
  cask "cursorcerer"
  cask "ledger-live"
  cask "qflipper"
  cask "steam"

  mas "Reeder", id: 1529448980
  mas "Wallpaper Wizard", id: 1266674560
  mas "Draw Things", id: 6444050820
end

Dir['.Brewfile.*'].each { |brewfile| load brewfile }
